# Nama  : Yusuf Ginanjar
# NIM   : 1227050136
# Prak Pembelajaran Mesin Pert 4

#### Data students.csv termasuk kedalam data nominal, ordinal, dan rasio.

In [7]:
import pandas as pd

## Modul 2 Analisis data

In [15]:
# reading the database
data = pd.read_csv("students.csv")

# printing the top 10 rows
display(data.head(10))

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72,72.0,74,8.0
1,female,group C,some college,standard,completed,69,90.0,88,7.0
2,female,group B,master's degree,standard,none,90,95.0,93,7.0
3,male,group A,associate's degree,free/reduced,none,47,57.0,44,8.0
4,male,group C,some college,standard,none,76,78.0,75,8.0
5,female,group B,associate's degree,standard,none,71,83.0,78,7.0
6,female,group B,some college,NaN,completed,88,95.0,92,NaN
7,male,group B,some college,free/reduced,none,40,43.0,39,8.0
8,male,group D,high school,free/reduced,completed,64,64.0,67,NaN
9,female,group B,high school,free/reduced,none,38,60.0,50,9.0

In [18]:
data.filter(["race/ethnicity", "parental level of education", "lunch", "grade"]).head()

  race/ethnicity parental level of education         lunch  grade
0        group B           bachelor's degree      standard    8.0
1        group C                some college      standard    7.0
2        group B             master's degree      standard    7.0
3        group A          associate's degree  free/reduced    8.0
4        group C                some college      standard    8.0

In [20]:
# Sorting quantity (most)
data.sort_values("grade", axis=0, ascending=False, inplace=True, na_position="last")
display(data.head())

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
9,female,group B,high school,free/reduced,none,38,60.0,50,9.0
966,male,group A,some high school,standard,completed,66,68.0,64,9.0
971,male,group C,some high school,standard,completed,78,72.0,69,9.0
972,female,group A,high school,free/reduced,completed,53,50.0,60,9.0
958,female,group D,high school,standard,none,45,63.0,59,9.0

In [26]:
# Group Total Sales by City
grp1 = data.groupby('race/ethnicity')
result = grp1['grade'].aggregate('sum')
print(result)

race/ethnicity
group A     706.0
group B    1494.0
group C    2520.0
group D    2050.0
group E    1105.0
Name: grade, dtype: float64

## Modul 3 Data Cleaning dan Transformation

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 9 to 969
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        975 non-null    object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                976 non-null    float64
 7   writing score                1000 non-null   int64
 8   grade                        985 non-null    float64
dtypes: float64(2), int64(2), object(5)
memory usage: 78.1+ KB

In [28]:
data.isna().sum()

gender                          0
race/ethnicity                  0
parental level of education     0
lunch                          25
test preparation course         0
math score                      0
reading score                  24
writing score                   0
grade                          15
dtype: int64

In [30]:
# Filling Nan Value with mode
data['lunch'].fillna(data['lunch'].mode()[0], inplace=True)

In [31]:
# Filling Nan Value with mean
data['reading score'].fillna(data['reading score'].mean(), inplace=True)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_11232\243819342.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['reading score'].fillna(data['reading score'].mean(), inplace=True)

In [34]:
# Filling Nan Value with mode
data['grade'].fillna(data['grade'].median(), inplace=True)

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 9 to 969
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   float64
 7   writing score                1000 non-null   int64
 8   grade                        1000 non-null   float64
dtypes: float64(2), int64(2), object(5)
memory usage: 78.1+ KB

In [38]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
grade                          0
dtype: int64